//
//  QYDSIntroduction.m
//  MHRefresh
//
//  Created by panle on 2019/7/3.
//  Copyright © 2019 developer. All rights reserved.
//

#import "QYDSIntroduction.h"

@implementation QYDSIntroduction

/**
 数据结构：是相互之间存在一种或多种特定关系的数据元素的集合。
 
 数据结构是一门研究非数值计算的程序设计问题中的操作对象，以及它们之间的关系和操作等相关问题的学科。
 
 程序设计的实质是对确定问题选择一种好的结构，加上设计一种好的算法。
 
 程序设计  =  数据结构 + 算法
 
 数据是描述客观事物的符号，是计算机中可以操作的对象，是能被计算机识别，并输入给计算机处理的符号集合。
 数据元素：是组成数据的、有一定意义的基本单位，在计算机中通常作为整体处理。
 数据项：一个数据元素可以🈶若干个数据项组成。 数据项是数据不可分割的最小单位。
 数据对象：是性质相同的数据元素的集合，是数据的子集。
 数据结构：结构，就是关系。
 
 逻辑结构和物理结构
 逻辑结构：是指数据对象中数据元素之间的相互关系。
    集合结构：集合结构中的数据元素除了同属于一个集合外，他们之间没有其它关系。
    线性结构：线性结构中的数据元素是一对一的关系。
    树形结构：数据元素之间存在着一种一对多的层次关系。
    图形结构：数据元素之间是多对多的关系。
 
 物理结构：指数据的逻辑结构在计算机中的存储形式。
    顺序存储结构：是把数据元素放在地址连续的空间里面，其数据间的逻辑关系和屋里关系是一致的。
    链式存储结构：把数据元素放在任意的存储单元里，这组存储单元可以是连续的，也可以不是连续的。
 
 逻辑结构是面向问题的，物理结构是面向计算机的，其基本目标就是把数据和逻辑关系存储到计算机的内存中。
 
 抽象数据类型
 数据类型：是指一组性质相同的值的集合以及定义在此集合上的一些操作的总称。
 
 在c语言中，按照取值的不同，数据类型可以分为两类：
 原子类型：是不可以再分解的基本类型，包括整形、实型、字符型等。
 结构类型：由若干个类型组合而成，是可以再分解的。
 
 抽象是指抽取出事物具有的普遍性的本质。抽象是一种思考方式，它隐藏了繁杂的细节，只保留实现目标的必要的信息。
 
 抽象数据类型：是指一个数学模型以及定义在该模型上的一组操作。
 
 抽象数据模型体现了程序设计中的问题分解、抽象和信息隐藏的特性。
 */


/**
 
 算法
 
 算法是解决特定问题求解步骤的描述，在计算机中表现为指令的有限序列，并且每条指令表示一个或多个操作。
 
 数据结构和算法的关系：两者相辅相成。
 
 */

@end
